[
  {
    "name": "Dr. Rajiv V. Dharaskar",
    "role": "Director IIIT Kottayam",
    "image": "/images/peoples_section/director.jpg",
     "message": "IIIT Kottayam has demonstrated rapid progress in its four years of existence. Having managed to set up a permanent campus despite the terrible weather conditions and the back-to-back floods, is testament to the resilience of our faculty. To give our students an understanding of how management of funds and people takes place in the real world, we have also decided to introduce single credit business courses into our syllabus. The combination of the two disciplines gives our students an all-rounded perspective of the industry’s challenges and prepares them to take on any situation head-on. We look forward to working with your organization and welcome you to the on-campus placements. With Best Wishes!"
  },
  {
    "name": "Dr. M Radhakrishnan",
    "role": "Registrar IIIT Kottayam",
    "image": "/images/peoples_section/registrar1.jpg",
    "message": "Indian Institute of Information Technology, Kottayam, is a budding institute bound to reach heights, the likes of which have never been seen before. The institute has its own permanent campus with world-class facilities provided to both teachers and students. I believe that you as the recruiting organization and our graduating students will find the best match between your needs and their capabilities. With Best Wishes!"
  },
  {
    "name": "Dr. Mathew C D",
    "role": "IIITK Placement Cell",
    "image": "/images/peoples_section/pic.jpg",
    "message": "With the world moving at an extraordinary pace, it is of utmost importance to provide a curriculum that is dynamic enough to cope with it. Ensuring that is IIIT Kottayam’s number one priority. IIITK prides itself on the balance that it strikes between academic courses and entrepreneurial experience provided to our students. Our startup incubator, professional associations, and industry collaborations are testimony to the emphasis IIITK places on presenting well-rounded engineering graduates to enter and grow into leadership positions in industries. "
  },
  {
    "name": "Dr. Mathew C D",
    "role": "IIITK Placement Cell",
    "image": "/images/peoples_section/mathew.jpeg",
    "message": "The first batch of IIIT Kottayam got passed out in 2019, we made remarkable progress in campus placements over the years. Last year the highest salary touched a whopping figure of 58.3 lakhs, with the average salary being 14.3 lpa. Even during this recession time IIIT kottayam students bagged 114 individual offers and total 142 offers. Placement cell concentrates on hardware, software, consulting, banking, fintech companies etc. We are looking forward to your esteemed organization to visit our campus and recruit our students. With Best Wishes!"
  }
]
